## importing required libraries

In [1]:
import pandas as pd
import numpy as np

In [1]:
#1)Series 2) DataFrame 3) Panel
#1) Series-> 1-D labelled array
#2) DataFrame->Combination of 1 or more series

## Creating a Pandas Series from Numpy Arrays

In [35]:
#For creating series we have to instantiate a class called Series

In [3]:
#Consider an array of stationary materials
x=np.array(["Pen","Notebook","Eraser","Sharpner"])
series1=pd.Series(x) #It will create series with index from given numpy array
print(series1)

0         Pen
1    Notebook
2      Eraser
3    Sharpner
dtype: object

In [19]:
#using index attribute we can assign index to the elements of series
series2=pd.Series(x,index=[100,101,102,103])
print(series2)

100         Pen
101    Notebook
102      Eraser
103    Sharpner
dtype: object

In [4]:
#we can also pass name to the series using name parameter but it is optional
series2=pd.Series(x,index=[100,101,102,103],name="Stationary")
print(series2)

100         Pen
101    Notebook
102      Eraser
103    Sharpner
Name: Stationary, dtype: object

In [6]:
series2.iloc[0:2]

100         Pen
101    Notebook
Name: Stationary, dtype: object

In [10]:
series2.loc[100:102]

100         Pen
101    Notebook
102      Eraser
Name: Stationary, dtype: object

## Creating Pandas Series from Dictionary

In [27]:
#consider a dictionary of squares
series3={1:1,2:4,3:9,4:16,5:25}
dict_series=pd.Series(squares)
print(dict_series)

1       1
2       4
3       9
4      16
5      25
10    100
dtype: int64

In [28]:
#in dictionaries there are predefined indexes so it will return NaN for new index
pd.Series(series3,index=[100,101,200,202])

100   NaN
101   NaN
200   NaN
202   NaN
dtype: float64

In [29]:
series3[10]=100

In [30]:
pd.Series(series3,index=[10,101,200,202])

10     100.0
101      NaN
200      NaN
202      NaN
dtype: float64

In [31]:
series3

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 10: 100}

## Creating a Pandas Series from a constant

In [33]:
#when we create a series from a single value it is necessary to pass the index parameter
series4=pd.Series(125,index=[0,1,2])
print(series4)

0    125
1    125
2    125
dtype: int64

In [ ]:
#when we pass only one value in the series,the value will be same for all the indexes

## Retrieving Data from a Pandas Series

In [21]:
#let's consider a series from above examples
print(series2)

100         Pen
101    Notebook
102      Eraser
103    Sharpner
Name: Stationary, dtype: object

In [23]:
series2[100]

'Pen'

In [26]:
series2[101]

'Notebook'

## Creating Dataframe from a Pandas Series

In [34]:
#let's create a series for quick revision
x=np.array([100,200,300,400])
y=pd.Series(x)
print(y)

0    100
1    200
2    300
3    400
dtype: int32

In [57]:
#For creating dataframe we have to instantiate a constructor of a class which is called as DataFrame
#like dictionaries index are predefined in dataframe also
pd.DataFrame(y,columns=["numbers"])

   numbers
0      100
1      200
2      300
3      400

In [42]:
x1=np.array(["Mobile","TV","Washing Machine","AC"])
y1=pd.Series(x1)

In [43]:
pd.DataFrame(y1,columns=["Items"])

             Items
0           Mobile
1               TV
2  Washing Machine
3               AC

## Creating Dataframe from lists

In [45]:
l1=["MS Dhoni","Virat Kohli","Rohit Sharma"]
type(l1)

list

In [47]:
pd.DataFrame(l1,columns=["Player Name"])

    Player Name
0      MS Dhoni
1   Virat Kohli
2  Rohit Sharma

In [52]:
#list of person's details->name,age,contact
details_list=[["Falcon",30,1234567],["Winter Soldier",35,1293912],["Vision",40,1213343],["Iron Man",36,1233443]]

In [53]:
pd.DataFrame(details_list,index=[1,2,3,4],columns=["Name","Age","Contact"])

             Name  Age  Contact
1          Falcon   30  1234567
2  Winter Soldier   35  1293912
3          Vision   40  1213343
4        Iron Man   36  1233443

## Creating Dataframe from Dictionary

In [54]:
details={
"Name":["Vijay","Ajith","Ram","Varun"],
"Age":[40,50,35,30],
}

In [55]:
details

{'Name': ['Vijay', 'Ajith', 'Ram', 'Varun'], 'Age': [40, 50, 35, 30]}

In [56]:
pd.DataFrame(details,index=[1001,1002,1003,1004])

       Name  Age
1001  Vijay   40
1002  Ajith   50
1003    Ram   35
1004  Varun   30

## Creating a Dataframe from numpy array

In [2]:
n1=np.array([10,20,30,40,50,60,70,80])

In [3]:
pd.DataFrame(n1,columns=["numbers"])

   numbers
0       10
1       20
2       30
3       40
4       50
5       60
6       70
7       80

## Reading a Dataset in Pandas

In [4]:
#we have 3 functions to read a dataset
#read_csv is used to read data from a csv file
#read_excel is used to read excel sheet data
#read_json is used to read json formatted data

In [9]:
pd.read_csv("sample.csv")

      name  age   contact
0   Arvind   20  29322929
1   Joseph   25  83837262
2  Anthony   30  22823923

In [12]:
data=pd.read_csv("automobile.csv")

In [19]:
#type returns the datatype of dataset
type(data)

pandas.core.frame.DataFrame

In [14]:
data

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [15]:
data1=pd.read_csv("housing.csv")

In [16]:
data1

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [18]:
#head() function will return first 5 rows from the dataset
data1.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [21]:
#tail() function is complete opposite of head(),it returns the five rows from the bottom of dataset
data1.tail()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [23]:
#columns attribute returns the names of columns from the dataset
data1.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

In [24]:
len(data1.columns)

10

In [26]:
#describe() will give total count,mean,standard deviation,minimum value,25th percentile,50th percentile 75th percentile and maximum value for each column
data1.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [30]:
data1.iloc[1,0] #data.iloc(row index,column index)

-122.22

In [34]:
data1.iloc[0:5,:]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [36]:
data1.iloc[:,0]

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

In [37]:
type(data1.iloc[:,1])

pandas.core.series.Series

In [38]:
pd.DataFrame(data1.iloc[:,1])

       latitude
0         37.88
1         37.86
2         37.85
3         37.85
4         37.85
...         ...
20635     39.48
20636     39.49
20637     39.43
20638     39.43
20639     39.37

[20640 rows x 1 columns]